spec/fixtures/items_acknowledge_wire.yml

---
http_interactions:
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"1f7ffc98-b1e3-4dc0-8db7-63952f449f92","first_name":"myFirstName","email":"1f7ffc98-b1e3-4dc0-8db7-63952f449f92@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 18:26:53 GMT
      Etag:
      - W/"dc774f0716b507b46a9a459d39c8205a"
      Location:
      - "/users/1f7ffc98-b1e3-4dc0-8db7-63952f449f92"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - b9ae4fe3-d202-4bf2-bcb9-760a5acbf75d
      X-Runtime:
      - '0.720926'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-05-29T18:26:53.027Z","updated_at":"2016-05-29T18:26:53.027Z","full_name":"myFirstName","email":"1f7ffc98-b1e3-4dc0-8db7-63952f449f92@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"1f7ffc98-b1e3-4dc0-8db7-63952f449f92","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"853a1001-7e70-434e-9f59-2a59107bb474"},"links":{"self":"/users","items":"/users/1f7ffc98-b1e3-4dc0-8db7-63952f449f92/items","card_accounts":"/users/1f7ffc98-b1e3-4dc0-8db7-63952f449f92/card_accounts","paypal_accounts":"/users/1f7ffc98-b1e3-4dc0-8db7-63952f449f92/paypal_accounts","bank_accounts":"/users/1f7ffc98-b1e3-4dc0-8db7-63952f449f92/bank_accounts","wallet_accounts":"/users/1f7ffc98-b1e3-4dc0-8db7-63952f449f92/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 18:26:53 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"5c03f3d6-052e-44a3-a6e0-42fb67b900ce","first_name":"myFirstName","email":"5c03f3d6-052e-44a3-a6e0-42fb67b900ce@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 18:26:54 GMT
      Etag:
      - W/"6e6134a440d14eefc4f752bbc346977b"
      Location:
      - "/users/5c03f3d6-052e-44a3-a6e0-42fb67b900ce"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - f826738f-9585-4dd1-b472-eb7599001f13
      X-Runtime:
      - '0.727074'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-05-29T18:26:54.490Z","updated_at":"2016-05-29T18:26:54.490Z","full_name":"myFirstName","email":"5c03f3d6-052e-44a3-a6e0-42fb67b900ce@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"5c03f3d6-052e-44a3-a6e0-42fb67b900ce","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"98c00968-2b23-4aef-82f6-e548ef15b1af"},"links":{"self":"/users","items":"/users/5c03f3d6-052e-44a3-a6e0-42fb67b900ce/items","card_accounts":"/users/5c03f3d6-052e-44a3-a6e0-42fb67b900ce/card_accounts","paypal_accounts":"/users/5c03f3d6-052e-44a3-a6e0-42fb67b900ce/paypal_accounts","bank_accounts":"/users/5c03f3d6-052e-44a3-a6e0-42fb67b900ce/bank_accounts","wallet_accounts":"/users/5c03f3d6-052e-44a3-a6e0-42fb67b900ce/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 18:26:54 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items
    body:
      encoding: UTF-8
      string: '{"id":"3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac","name":"itemName","amount":500,"payment_type":1,"seller_id":"1f7ffc98-b1e3-4dc0-8db7-63952f449f92","buyer_id":"5c03f3d6-052e-44a3-a6e0-42fb67b900ce"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 18:26:56 GMT
      Etag:
      - W/"2d7206aeff8df0caf84a7762d01853e5"
      Location:
      - "/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 76a32814-f468-45e4-a4e8-06087d5a3016
      X-Runtime:
      - '1.154852'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"items":{"id":"3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac","name":"itemName","description":null,"created_at":"2016-05-29T18:26:55.889Z","updated_at":"2016-05-29T18:26:55.889Z","state":"pending","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22000,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014266208","promisepay_fee":8,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"pending","buyer_name":"myFirstName","buyer_email":"5c03f3d6-052e-44a3-a6e0-42fb67b900ce@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"1f7ffc98-b1e3-4dc0-8db7-63952f449f92@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"5c03f3d6-052e-44a3-a6e0-42fb67b900ce","sellers":"1f7ffc98-b1e3-4dc0-8db7-63952f449f92"},"links":{"self":"/items","buyers":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/buyers","sellers":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/sellers","status":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/status","fees":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/fees","transactions":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/transactions","wire_details":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/wire_details","bpay_details":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 18:26:56 GMT
- request:
    method: patch
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/acknowledge_wire
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 18:26:58 GMT
      Etag:
      - W/"9a34384d68082198c3042931c20bf87d"
      Location:
      - "/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=PATCH; path=/
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 0775081c-3ec9-4cc1-95ed-4ac1270016a9
      X-Runtime:
      - '0.660613'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"items":{"id":"3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac","name":"itemName","description":null,"created_at":"2016-05-29T18:26:55.889Z","updated_at":"2016-05-29T18:26:57.795Z","state":"wire_pending","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22110,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014266208","promisepay_fee":8,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"pending","buyer_name":"myFirstName","buyer_email":"5c03f3d6-052e-44a3-a6e0-42fb67b900ce@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"1f7ffc98-b1e3-4dc0-8db7-63952f449f92@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"5c03f3d6-052e-44a3-a6e0-42fb67b900ce","sellers":"1f7ffc98-b1e3-4dc0-8db7-63952f449f92"},"links":{"self":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/acknowledge_wire","buyers":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/buyers","sellers":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/sellers","status":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/status","fees":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/fees","transactions":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/transactions","wire_details":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/wire_details","bpay_details":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 18:26:58 GMT
- request:
    method: get
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.2
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 18:26:59 GMT
      Etag:
      - W/"8cfd72b2c192ef0195e15fde711049c6"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 9fe27eff-edde-4b7c-bf7f-a63e527cf24e
      X-Runtime:
      - '0.506364'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"items":{"id":"3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac","name":"itemName","description":null,"created_at":"2016-05-29T18:26:55.889Z","updated_at":"2016-05-29T18:26:57.795Z","state":"wire_pending","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22110,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014266208","promisepay_fee":8,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"pending","buyer_name":"myFirstName","buyer_email":"5c03f3d6-052e-44a3-a6e0-42fb67b900ce@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"1f7ffc98-b1e3-4dc0-8db7-63952f449f92@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"5c03f3d6-052e-44a3-a6e0-42fb67b900ce","sellers":"1f7ffc98-b1e3-4dc0-8db7-63952f449f92"},"links":{"self":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac","buyers":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/buyers","sellers":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/sellers","status":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/status","fees":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/fees","transactions":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/transactions","wire_details":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/wire_details","bpay_details":"/items/3c9813a3-6bd1-430d-8a1c-0ceedd3e9dac/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 18:26:59 GMT
recorded_with: VCR 2.9.3
