spec/fixtures/items_fees_empty.yml

---
http_interactions:
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"e9aba6a1-5cf0-4645-9ebb-883bdc96cce8","first_name":"myFirstName","email":"e9aba6a1-5cf0-4645-9ebb-883bdc96cce8@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:25:48 GMT
      Etag:
      - W/"8d190f0edf8d0731a7a9dce3e68969dd"
      Location:
      - "/users/e9aba6a1-5cf0-4645-9ebb-883bdc96cce8"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - ceffbaae-c1ff-4a49-9b6d-a899ac089960
      X-Runtime:
      - '0.734732'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-05-29T21:25:48.417Z","updated_at":"2016-05-29T21:25:48.417Z","full_name":"myFirstName","email":"e9aba6a1-5cf0-4645-9ebb-883bdc96cce8@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"e9aba6a1-5cf0-4645-9ebb-883bdc96cce8","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"b302a90d-b22a-436e-a3ff-5ad55a810b90"},"links":{"self":"/users","items":"/users/e9aba6a1-5cf0-4645-9ebb-883bdc96cce8/items","card_accounts":"/users/e9aba6a1-5cf0-4645-9ebb-883bdc96cce8/card_accounts","paypal_accounts":"/users/e9aba6a1-5cf0-4645-9ebb-883bdc96cce8/paypal_accounts","bank_accounts":"/users/e9aba6a1-5cf0-4645-9ebb-883bdc96cce8/bank_accounts","wallet_accounts":"/users/e9aba6a1-5cf0-4645-9ebb-883bdc96cce8/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:25:48 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"8f057f42-bca3-406e-b532-b88055383a2f","first_name":"myFirstName","email":"8f057f42-bca3-406e-b532-b88055383a2f@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:25:50 GMT
      Etag:
      - W/"38cac3db111e3f650a10e46521ac6809"
      Location:
      - "/users/8f057f42-bca3-406e-b532-b88055383a2f"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 86c5c3bb-318b-4e96-9260-a7cadf222ad9
      X-Runtime:
      - '0.782310'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-05-29T21:25:50.162Z","updated_at":"2016-05-29T21:25:50.162Z","full_name":"myFirstName","email":"8f057f42-bca3-406e-b532-b88055383a2f@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"8f057f42-bca3-406e-b532-b88055383a2f","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"cb2946d0-81cd-4974-8990-02f1c7ccc384"},"links":{"self":"/users","items":"/users/8f057f42-bca3-406e-b532-b88055383a2f/items","card_accounts":"/users/8f057f42-bca3-406e-b532-b88055383a2f/card_accounts","paypal_accounts":"/users/8f057f42-bca3-406e-b532-b88055383a2f/paypal_accounts","bank_accounts":"/users/8f057f42-bca3-406e-b532-b88055383a2f/bank_accounts","wallet_accounts":"/users/8f057f42-bca3-406e-b532-b88055383a2f/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:25:50 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items
    body:
      encoding: UTF-8
      string: '{"id":"0dae6b69-f580-4d83-aa91-8790999202ce","name":"itemName","amount":500,"payment_type":1,"seller_id":"e9aba6a1-5cf0-4645-9ebb-883bdc96cce8","buyer_id":"8f057f42-bca3-406e-b532-b88055383a2f"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:25:52 GMT
      Etag:
      - W/"eb1e6340a1b779b957891d16fe198fa1"
      Location:
      - "/items/0dae6b69-f580-4d83-aa91-8790999202ce"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 89606915-8c97-41ed-a780-f986e5579332
      X-Runtime:
      - '1.328893'
      X-Xss-Protection:
      - 1; mode=block
      Content-Length:
      - '1499'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"items":{"id":"0dae6b69-f580-4d83-aa91-8790999202ce","name":"itemName","description":null,"created_at":"2016-05-29T21:25:51.735Z","updated_at":"2016-05-29T21:25:51.735Z","state":"pending","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22000,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014267004","promisepay_fee":8,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"pending","buyer_name":"myFirstName","buyer_email":"8f057f42-bca3-406e-b532-b88055383a2f@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"e9aba6a1-5cf0-4645-9ebb-883bdc96cce8@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"8f057f42-bca3-406e-b532-b88055383a2f","sellers":"e9aba6a1-5cf0-4645-9ebb-883bdc96cce8"},"links":{"self":"/items","buyers":"/items/0dae6b69-f580-4d83-aa91-8790999202ce/buyers","sellers":"/items/0dae6b69-f580-4d83-aa91-8790999202ce/sellers","status":"/items/0dae6b69-f580-4d83-aa91-8790999202ce/status","fees":"/items/0dae6b69-f580-4d83-aa91-8790999202ce/fees","transactions":"/items/0dae6b69-f580-4d83-aa91-8790999202ce/transactions","wire_details":"/items/0dae6b69-f580-4d83-aa91-8790999202ce/wire_details","bpay_details":"/items/0dae6b69-f580-4d83-aa91-8790999202ce/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:25:52 GMT
- request:
    method: get
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/0dae6b69-f580-4d83-aa91-8790999202ce/fees
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.2
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:25:54 GMT
      Etag:
      - W/"92bcaeec9eb2b22a4ad7cba68011953d"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 076757f6-fe2f-43cb-81c4-0afe035e3115
      X-Runtime:
      - '0.680852'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"meta":{"limit":10,"offset":0,"total":0},"links":{"self":"/items/0dae6b69-f580-4d83-aa91-8790999202ce/fees"}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:25:54 GMT
recorded_with: VCR 2.9.3
