spec/fixtures/items_request_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"7b2241d7-e2be-4d0e-8b9b-cc5bd4d864d7","first_name":"myFirstName","email":"7b2241d7-e2be-4d0e-8b9b-cc5bd4d864d7@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 18:51:31 GMT
      Etag:
      - W/"7f17f4c061a45ff6cb6712520122ddcd"
      Location:
      - "/users/7b2241d7-e2be-4d0e-8b9b-cc5bd4d864d7"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - ecdb477d-759e-4a95-a9c8-d2a62a32c1ef
      X-Runtime:
      - '0.933188'
      X-Xss-Protection:
      - 1; mode=block
      Content-Length:
      - '932'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-05-29T18:51:31.108Z","updated_at":"2016-05-29T18:51:31.108Z","full_name":"myFirstName","email":"7b2241d7-e2be-4d0e-8b9b-cc5bd4d864d7@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"7b2241d7-e2be-4d0e-8b9b-cc5bd4d864d7","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"3b11a06a-c7de-4c98-9d7b-01aa35ee4678"},"links":{"self":"/users","items":"/users/7b2241d7-e2be-4d0e-8b9b-cc5bd4d864d7/items","card_accounts":"/users/7b2241d7-e2be-4d0e-8b9b-cc5bd4d864d7/card_accounts","paypal_accounts":"/users/7b2241d7-e2be-4d0e-8b9b-cc5bd4d864d7/paypal_accounts","bank_accounts":"/users/7b2241d7-e2be-4d0e-8b9b-cc5bd4d864d7/bank_accounts","wallet_accounts":"/users/7b2241d7-e2be-4d0e-8b9b-cc5bd4d864d7/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 18:51:31 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"18c9f254-3930-48b2-b251-d420c4d19b89","first_name":"myFirstName","email":"18c9f254-3930-48b2-b251-d420c4d19b89@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 18:51:32 GMT
      Etag:
      - W/"326a8b99be1cbb3665a36c367e9f5950"
      Location:
      - "/users/18c9f254-3930-48b2-b251-d420c4d19b89"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 1c39097b-03a5-4c47-8721-7f5f08df3e65
      X-Runtime:
      - '0.782492'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-05-29T18:51:32.621Z","updated_at":"2016-05-29T18:51:32.621Z","full_name":"myFirstName","email":"18c9f254-3930-48b2-b251-d420c4d19b89@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"18c9f254-3930-48b2-b251-d420c4d19b89","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"ada0c3e5-e288-4140-a22f-8b6de1eea32d"},"links":{"self":"/users","items":"/users/18c9f254-3930-48b2-b251-d420c4d19b89/items","card_accounts":"/users/18c9f254-3930-48b2-b251-d420c4d19b89/card_accounts","paypal_accounts":"/users/18c9f254-3930-48b2-b251-d420c4d19b89/paypal_accounts","bank_accounts":"/users/18c9f254-3930-48b2-b251-d420c4d19b89/bank_accounts","wallet_accounts":"/users/18c9f254-3930-48b2-b251-d420c4d19b89/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 18:51:32 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items
    body:
      encoding: UTF-8
      string: '{"id":"ab51020f-6530-4a0c-a50e-228ede7a5096","name":"itemName","amount":500,"payment_type":1,"seller_id":"7b2241d7-e2be-4d0e-8b9b-cc5bd4d864d7","buyer_id":"18c9f254-3930-48b2-b251-d420c4d19b89"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 18:51:35 GMT
      Etag:
      - W/"1dfa91ca12784c3d88fa1496c4c0e1cc"
      Location:
      - "/items/ab51020f-6530-4a0c-a50e-228ede7a5096"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - ce3037c8-50a5-40b5-83f5-bb3ed11c4988
      X-Runtime:
      - '1.960998'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"items":{"id":"ab51020f-6530-4a0c-a50e-228ede7a5096","name":"itemName","description":null,"created_at":"2016-05-29T18:51:34.029Z","updated_at":"2016-05-29T18:51:34.029Z","state":"pending","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22000,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014266351","promisepay_fee":8,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"pending","buyer_name":"myFirstName","buyer_email":"18c9f254-3930-48b2-b251-d420c4d19b89@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"7b2241d7-e2be-4d0e-8b9b-cc5bd4d864d7@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"18c9f254-3930-48b2-b251-d420c4d19b89","sellers":"7b2241d7-e2be-4d0e-8b9b-cc5bd4d864d7"},"links":{"self":"/items","buyers":"/items/ab51020f-6530-4a0c-a50e-228ede7a5096/buyers","sellers":"/items/ab51020f-6530-4a0c-a50e-228ede7a5096/sellers","status":"/items/ab51020f-6530-4a0c-a50e-228ede7a5096/status","fees":"/items/ab51020f-6530-4a0c-a50e-228ede7a5096/fees","transactions":"/items/ab51020f-6530-4a0c-a50e-228ede7a5096/transactions","wire_details":"/items/ab51020f-6530-4a0c-a50e-228ede7a5096/wire_details","bpay_details":"/items/ab51020f-6530-4a0c-a50e-228ede7a5096/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 18:51:35 GMT
- request:
    method: patch
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/ab51020f-6530-4a0c-a50e-228ede7a5096/request_payment
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 18:51:37 GMT
      Etag:
      - W/"9b63a700ab8875846585e52f0e53dfc3"
      Location:
      - "/items/ab51020f-6530-4a0c-a50e-228ede7a5096"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=PATCH; path=/
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 234a5a35-9eae-4e1b-8421-dc468c50da82
      X-Runtime:
      - '0.794883'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"items":{"id":"ab51020f-6530-4a0c-a50e-228ede7a5096","name":"itemName","description":null,"created_at":"2016-05-29T18:51:34.029Z","updated_at":"2016-05-29T18:51:36.732Z","state":"payment_required","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22100,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014266351","promisepay_fee":8,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"pending","buyer_name":"myFirstName","buyer_email":"18c9f254-3930-48b2-b251-d420c4d19b89@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"7b2241d7-e2be-4d0e-8b9b-cc5bd4d864d7@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"18c9f254-3930-48b2-b251-d420c4d19b89","sellers":"7b2241d7-e2be-4d0e-8b9b-cc5bd4d864d7"},"links":{"self":"/items/ab51020f-6530-4a0c-a50e-228ede7a5096/request_payment","buyers":"/items/ab51020f-6530-4a0c-a50e-228ede7a5096/buyers","sellers":"/items/ab51020f-6530-4a0c-a50e-228ede7a5096/sellers","status":"/items/ab51020f-6530-4a0c-a50e-228ede7a5096/status","fees":"/items/ab51020f-6530-4a0c-a50e-228ede7a5096/fees","transactions":"/items/ab51020f-6530-4a0c-a50e-228ede7a5096/transactions","wire_details":"/items/ab51020f-6530-4a0c-a50e-228ede7a5096/wire_details","bpay_details":"/items/ab51020f-6530-4a0c-a50e-228ede7a5096/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 18:51:37 GMT
recorded_with: VCR 2.9.3
