spec/fixtures/items_request_refund.yml

---
http_interactions:
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"8823b8fc-2e43-44c5-8d4a-ad7b6cbb1371","first_name":"myFirstName","email":"8823b8fc-2e43-44c5-8d4a-ad7b6cbb1371@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:18:32 GMT
      Etag:
      - W/"101533ba7562bac40715e4da4b91ff5d"
      Location:
      - "/users/8823b8fc-2e43-44c5-8d4a-ad7b6cbb1371"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - e41c6190-3921-44c9-af57-db14d508b39f
      X-Runtime:
      - '0.789336'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-05-29T21:18:31.951Z","updated_at":"2016-05-29T21:18:31.951Z","full_name":"myFirstName","email":"8823b8fc-2e43-44c5-8d4a-ad7b6cbb1371@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"8823b8fc-2e43-44c5-8d4a-ad7b6cbb1371","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"94a55f3e-00e8-4766-b3bc-a14ff4abcd82"},"links":{"self":"/users","items":"/users/8823b8fc-2e43-44c5-8d4a-ad7b6cbb1371/items","card_accounts":"/users/8823b8fc-2e43-44c5-8d4a-ad7b6cbb1371/card_accounts","paypal_accounts":"/users/8823b8fc-2e43-44c5-8d4a-ad7b6cbb1371/paypal_accounts","bank_accounts":"/users/8823b8fc-2e43-44c5-8d4a-ad7b6cbb1371/bank_accounts","wallet_accounts":"/users/8823b8fc-2e43-44c5-8d4a-ad7b6cbb1371/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:18:32 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"fed2925d-e1f8-4c47-919f-70e19634444d","first_name":"myFirstName","email":"fed2925d-e1f8-4c47-919f-70e19634444d@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:18:33 GMT
      Etag:
      - W/"3b670ec8d9811ff38b9621113ac66b84"
      Location:
      - "/users/fed2925d-e1f8-4c47-919f-70e19634444d"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - c99a4941-6190-4de8-9b5e-585d72ff5852
      X-Runtime:
      - '0.739876'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-05-29T21:18:33.686Z","updated_at":"2016-05-29T21:18:33.686Z","full_name":"myFirstName","email":"fed2925d-e1f8-4c47-919f-70e19634444d@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"fed2925d-e1f8-4c47-919f-70e19634444d","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"8e9f89ec-5d83-4793-9505-3bfec9dc065f"},"links":{"self":"/users","items":"/users/fed2925d-e1f8-4c47-919f-70e19634444d/items","card_accounts":"/users/fed2925d-e1f8-4c47-919f-70e19634444d/card_accounts","paypal_accounts":"/users/fed2925d-e1f8-4c47-919f-70e19634444d/paypal_accounts","bank_accounts":"/users/fed2925d-e1f8-4c47-919f-70e19634444d/bank_accounts","wallet_accounts":"/users/fed2925d-e1f8-4c47-919f-70e19634444d/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:18:33 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items
    body:
      encoding: UTF-8
      string: '{"id":"7f8518c3-4653-406b-83e9-065bc73bafe7","name":"itemName","amount":500,"payment_type":1,"seller_id":"8823b8fc-2e43-44c5-8d4a-ad7b6cbb1371","buyer_id":"fed2925d-e1f8-4c47-919f-70e19634444d"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:18:35 GMT
      Etag:
      - W/"05ddb5cd74a839fa32b5c680fbcd7af0"
      Location:
      - "/items/7f8518c3-4653-406b-83e9-065bc73bafe7"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 227432fb-bbaa-41a7-ae7e-771d4cf8f17b
      X-Runtime:
      - '1.119943'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"items":{"id":"7f8518c3-4653-406b-83e9-065bc73bafe7","name":"itemName","description":null,"created_at":"2016-05-29T21:18:35.087Z","updated_at":"2016-05-29T21:18:35.087Z","state":"pending","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22000,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014266771","promisepay_fee":8,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"pending","buyer_name":"myFirstName","buyer_email":"fed2925d-e1f8-4c47-919f-70e19634444d@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"8823b8fc-2e43-44c5-8d4a-ad7b6cbb1371@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"fed2925d-e1f8-4c47-919f-70e19634444d","sellers":"8823b8fc-2e43-44c5-8d4a-ad7b6cbb1371"},"links":{"self":"/items","buyers":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/buyers","sellers":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/sellers","status":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/status","fees":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/fees","transactions":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/transactions","wire_details":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/wire_details","bpay_details":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:18:35 GMT
- request:
    method: get
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/7f8518c3-4653-406b-83e9-065bc73bafe7/buyers
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.2
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:18:37 GMT
      Etag:
      - W/"40714f8eed704fd3ad61edeef9b590f5"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 799ed484-e85b-4a5f-8ba2-397b732e0cec
      X-Runtime:
      - '0.783125'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"users":{"created_at":"2016-05-29T21:18:33.686Z","updated_at":"2016-05-29T21:18:33.686Z","full_name":"myFirstName","email":"fed2925d-e1f8-4c47-919f-70e19634444d@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"fed2925d-e1f8-4c47-919f-70e19634444d","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"8e9f89ec-5d83-4793-9505-3bfec9dc065f"},"links":{"self":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/buyers","items":"/users/fed2925d-e1f8-4c47-919f-70e19634444d/items","card_accounts":"/users/fed2925d-e1f8-4c47-919f-70e19634444d/card_accounts","paypal_accounts":"/users/fed2925d-e1f8-4c47-919f-70e19634444d/paypal_accounts","bank_accounts":"/users/fed2925d-e1f8-4c47-919f-70e19634444d/bank_accounts","wallet_accounts":"/users/fed2925d-e1f8-4c47-919f-70e19634444d/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:18:37 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/card_accounts
    body:
      encoding: UTF-8
      string: '{"user_id":"fed2925d-e1f8-4c47-919f-70e19634444d","full_name":"User
        Name","number":"4111111111111111","expiry_month":5,"expiry_year":2017,"cvv":"123"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:18:39 GMT
      Etag:
      - W/"27579643fed6020bf0324ccf6f58e2b9"
      Location:
      - "/card_accounts/76fdc462-b184-497f-986e-51f22b011b79"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 1b9b9383-3e9c-46e5-9e9c-0d515f1f2201
      X-Runtime:
      - '1.469979'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"card_accounts":{"active":true,"created_at":"2016-05-29T21:18:39.782Z","updated_at":"2016-05-29T21:18:39.782Z","id":"76fdc462-b184-497f-986e-51f22b011b79","currency":"AUD","links":{"self":"/card_accounts/76fdc462-b184-497f-986e-51f22b011b79","users":"/card_accounts/76fdc462-b184-497f-986e-51f22b011b79/users"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:18:40 GMT
- request:
    method: patch
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/7f8518c3-4653-406b-83e9-065bc73bafe7/make_payment
    body:
      encoding: UTF-8
      string: '{"user_id":"fed2925d-e1f8-4c47-919f-70e19634444d","account_id":"76fdc462-b184-497f-986e-51f22b011b79"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:18:46 GMT
      Etag:
      - W/"adbe8443d982dcb5bf08f41bfb76a14c"
      Location:
      - "/items/7f8518c3-4653-406b-83e9-065bc73bafe7"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=PATCH; path=/
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - bb58eeca-de5a-4028-87d1-4d77fd380021
      X-Runtime:
      - '5.602968'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"items":{"id":"7f8518c3-4653-406b-83e9-065bc73bafe7","name":"itemName","description":null,"created_at":"2016-05-29T21:18:35.087Z","updated_at":"2016-05-29T21:18:46.077Z","state":"payment_deposited","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22200,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014266771","promisepay_fee":47,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"credit
        card","buyer_name":"myFirstName","buyer_email":"fed2925d-e1f8-4c47-919f-70e19634444d@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"8823b8fc-2e43-44c5-8d4a-ad7b6cbb1371@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"fed2925d-e1f8-4c47-919f-70e19634444d","sellers":"8823b8fc-2e43-44c5-8d4a-ad7b6cbb1371"},"links":{"self":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/make_payment","buyers":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/buyers","sellers":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/sellers","status":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/status","fees":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/fees","transactions":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/transactions","wire_details":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/wire_details","bpay_details":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:18:46 GMT
- request:
    method: patch
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/7f8518c3-4653-406b-83e9-065bc73bafe7/request_refund
    body:
      encoding: UTF-8
      string: '{"refund_amount":500,"refund_message":"because"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:18:47 GMT
      Etag:
      - W/"54cdf1b7cce88aeb50f1183f3e792cf8"
      Location:
      - "/items/7f8518c3-4653-406b-83e9-065bc73bafe7"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=PATCH; path=/
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 69c260a9-8d6a-4f2c-bdbf-b4c6fd703f83
      X-Runtime:
      - '0.670041'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"items":{"id":"7f8518c3-4653-406b-83e9-065bc73bafe7","name":"itemName","description":null,"created_at":"2016-05-29T21:18:35.087Z","updated_at":"2016-05-29T21:18:47.691Z","state":"refund_flagged","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22650,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014266771","promisepay_fee":47,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"credit
        card","refund_message":"because","refund_amount":500,"buyer_name":"myFirstName","buyer_email":"fed2925d-e1f8-4c47-919f-70e19634444d@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"8823b8fc-2e43-44c5-8d4a-ad7b6cbb1371@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"fed2925d-e1f8-4c47-919f-70e19634444d","sellers":"8823b8fc-2e43-44c5-8d4a-ad7b6cbb1371"},"links":{"self":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/request_refund","buyers":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/buyers","sellers":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/sellers","status":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/status","fees":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/fees","transactions":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/transactions","wire_details":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/wire_details","bpay_details":"/items/7f8518c3-4653-406b-83e9-065bc73bafe7/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:18:48 GMT
recorded_with: VCR 2.9.3
