spec/fixtures/items_request_release.yml

---
http_interactions:
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"2ede8fda-9fea-401a-83eb-359eeb0a4ffa","first_name":"myFirstName","email":"2ede8fda-9fea-401a-83eb-359eeb0a4ffa@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:12:24 GMT
      Etag:
      - W/"5d2029c26f5b71f83bb3ec4f0c48711f"
      Location:
      - "/users/2ede8fda-9fea-401a-83eb-359eeb0a4ffa"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 12fadca1-f33f-4b29-9c14-af6c80662506
      X-Runtime:
      - '0.751517'
      X-Xss-Protection:
      - 1; mode=block
      Content-Length:
      - '932'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-05-29T21:12:23.861Z","updated_at":"2016-05-29T21:12:23.861Z","full_name":"myFirstName","email":"2ede8fda-9fea-401a-83eb-359eeb0a4ffa@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"2ede8fda-9fea-401a-83eb-359eeb0a4ffa","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"79eb7502-2222-4ef3-acea-ab8b721efefc"},"links":{"self":"/users","items":"/users/2ede8fda-9fea-401a-83eb-359eeb0a4ffa/items","card_accounts":"/users/2ede8fda-9fea-401a-83eb-359eeb0a4ffa/card_accounts","paypal_accounts":"/users/2ede8fda-9fea-401a-83eb-359eeb0a4ffa/paypal_accounts","bank_accounts":"/users/2ede8fda-9fea-401a-83eb-359eeb0a4ffa/bank_accounts","wallet_accounts":"/users/2ede8fda-9fea-401a-83eb-359eeb0a4ffa/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:12:24 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"65745d77-9072-4743-917e-2df8aa5c91da","first_name":"myFirstName","email":"65745d77-9072-4743-917e-2df8aa5c91da@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:12:25 GMT
      Etag:
      - W/"3263cea43d061d143c8c95d0330056ac"
      Location:
      - "/users/65745d77-9072-4743-917e-2df8aa5c91da"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 9de02ef4-a6df-4ee1-b365-fbe0023d0bcc
      X-Runtime:
      - '0.758772'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-05-29T21:12:25.621Z","updated_at":"2016-05-29T21:12:25.621Z","full_name":"myFirstName","email":"65745d77-9072-4743-917e-2df8aa5c91da@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"65745d77-9072-4743-917e-2df8aa5c91da","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"767fe829-0741-46fa-b233-99bfc6113757"},"links":{"self":"/users","items":"/users/65745d77-9072-4743-917e-2df8aa5c91da/items","card_accounts":"/users/65745d77-9072-4743-917e-2df8aa5c91da/card_accounts","paypal_accounts":"/users/65745d77-9072-4743-917e-2df8aa5c91da/paypal_accounts","bank_accounts":"/users/65745d77-9072-4743-917e-2df8aa5c91da/bank_accounts","wallet_accounts":"/users/65745d77-9072-4743-917e-2df8aa5c91da/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:12:26 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items
    body:
      encoding: UTF-8
      string: '{"id":"50847dcd-87e0-45e1-aedc-1f84476dc090","name":"itemName","amount":500,"payment_type":1,"seller_id":"2ede8fda-9fea-401a-83eb-359eeb0a4ffa","buyer_id":"65745d77-9072-4743-917e-2df8aa5c91da"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:12:28 GMT
      Etag:
      - W/"916c632285a4ec98dd621621ea7d5abb"
      Location:
      - "/items/50847dcd-87e0-45e1-aedc-1f84476dc090"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 5fe16095-3263-40c0-afdc-232df64b4935
      X-Runtime:
      - '1.245881'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"items":{"id":"50847dcd-87e0-45e1-aedc-1f84476dc090","name":"itemName","description":null,"created_at":"2016-05-29T21:12:27.337Z","updated_at":"2016-05-29T21:12:27.337Z","state":"pending","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22000,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014266696","promisepay_fee":8,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"pending","buyer_name":"myFirstName","buyer_email":"65745d77-9072-4743-917e-2df8aa5c91da@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"2ede8fda-9fea-401a-83eb-359eeb0a4ffa@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"65745d77-9072-4743-917e-2df8aa5c91da","sellers":"2ede8fda-9fea-401a-83eb-359eeb0a4ffa"},"links":{"self":"/items","buyers":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/buyers","sellers":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/sellers","status":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/status","fees":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/fees","transactions":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/transactions","wire_details":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/wire_details","bpay_details":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:12:28 GMT
- request:
    method: get
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/50847dcd-87e0-45e1-aedc-1f84476dc090/buyers
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.2
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:12:29 GMT
      Etag:
      - W/"a7bb84221ae330f9899d2201c860235c"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - ec9d97dd-bd9c-4fdd-bc94-3f099b33bff8
      X-Runtime:
      - '0.738508'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"users":{"created_at":"2016-05-29T21:12:25.621Z","updated_at":"2016-05-29T21:12:25.621Z","full_name":"myFirstName","email":"65745d77-9072-4743-917e-2df8aa5c91da@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"65745d77-9072-4743-917e-2df8aa5c91da","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"767fe829-0741-46fa-b233-99bfc6113757"},"links":{"self":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/buyers","items":"/users/65745d77-9072-4743-917e-2df8aa5c91da/items","card_accounts":"/users/65745d77-9072-4743-917e-2df8aa5c91da/card_accounts","paypal_accounts":"/users/65745d77-9072-4743-917e-2df8aa5c91da/paypal_accounts","bank_accounts":"/users/65745d77-9072-4743-917e-2df8aa5c91da/bank_accounts","wallet_accounts":"/users/65745d77-9072-4743-917e-2df8aa5c91da/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:12:29 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/card_accounts
    body:
      encoding: UTF-8
      string: '{"user_id":"65745d77-9072-4743-917e-2df8aa5c91da","full_name":"User
        Name","number":"4111111111111111","expiry_month":5,"expiry_year":2017,"cvv":"123"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:12:31 GMT
      Etag:
      - W/"e92ed3d0817b40ff5c5b1287a2e87de1"
      Location:
      - "/card_accounts/b77ddcdd-f096-42f5-9aa0-dec5b28bf982"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 5f650c9c-c9b1-4790-8f34-13671ee118b4
      X-Runtime:
      - '1.369462'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"card_accounts":{"active":true,"created_at":"2016-05-29T21:12:31.861Z","updated_at":"2016-05-29T21:12:31.861Z","id":"b77ddcdd-f096-42f5-9aa0-dec5b28bf982","currency":"AUD","links":{"self":"/card_accounts/b77ddcdd-f096-42f5-9aa0-dec5b28bf982","users":"/card_accounts/b77ddcdd-f096-42f5-9aa0-dec5b28bf982/users"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:12:32 GMT
- request:
    method: patch
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/50847dcd-87e0-45e1-aedc-1f84476dc090/make_payment
    body:
      encoding: UTF-8
      string: '{"user_id":"65745d77-9072-4743-917e-2df8aa5c91da","account_id":"b77ddcdd-f096-42f5-9aa0-dec5b28bf982"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:12:38 GMT
      Etag:
      - W/"c206bf933121a2779351ce6ca50c24f4"
      Location:
      - "/items/50847dcd-87e0-45e1-aedc-1f84476dc090"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=PATCH; path=/
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 20a2f1d5-e275-48af-a3d3-f17c546146dd
      X-Runtime:
      - '6.088368'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"items":{"id":"50847dcd-87e0-45e1-aedc-1f84476dc090","name":"itemName","description":null,"created_at":"2016-05-29T21:12:27.337Z","updated_at":"2016-05-29T21:12:38.490Z","state":"payment_deposited","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22200,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014266696","promisepay_fee":47,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"credit
        card","buyer_name":"myFirstName","buyer_email":"65745d77-9072-4743-917e-2df8aa5c91da@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"2ede8fda-9fea-401a-83eb-359eeb0a4ffa@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"65745d77-9072-4743-917e-2df8aa5c91da","sellers":"2ede8fda-9fea-401a-83eb-359eeb0a4ffa"},"links":{"self":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/make_payment","buyers":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/buyers","sellers":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/sellers","status":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/status","fees":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/fees","transactions":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/transactions","wire_details":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/wire_details","bpay_details":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:12:39 GMT
- request:
    method: patch
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/50847dcd-87e0-45e1-aedc-1f84476dc090/request_release
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 29 May 2016 21:12:40 GMT
      Etag:
      - W/"9889af620ebb2bc00f7d59d7f4cdb895"
      Location:
      - "/items/50847dcd-87e0-45e1-aedc-1f84476dc090"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=PATCH; path=/
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - ea01f55f-2b24-43c7-9be1-e0dd628d8360
      X-Runtime:
      - '0.650083'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"items":{"id":"50847dcd-87e0-45e1-aedc-1f84476dc090","name":"itemName","description":null,"created_at":"2016-05-29T21:12:27.337Z","updated_at":"2016-05-29T21:12:40.179Z","state":"work_completed","net_amount":500,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"paypal_fee":0,"seller_url":"","buyer_url":"","direct_debit_fee":0,"status":22300,"amount":500,"payment_type_id":1,"due_date":null,"pending_release_amount":0,"deposit_reference":"100014014266696","promisepay_fee":47,"total_outstanding":500,"total_amount":500,"currency":"AUD","payment_method":"credit
        card","buyer_name":"myFirstName","buyer_email":"65745d77-9072-4743-917e-2df8aa5c91da@mail.com","buyer_country":"AUS","seller_name":"myFirstName","seller_email":"2ede8fda-9fea-401a-83eb-359eeb0a4ffa@mail.com","seller_country":"AUS","payment_credit_card_enabled":true,"payment_direct_debit_enabled":true,"related":{"buyers":"65745d77-9072-4743-917e-2df8aa5c91da","sellers":"2ede8fda-9fea-401a-83eb-359eeb0a4ffa"},"links":{"self":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/request_release","buyers":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/buyers","sellers":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/sellers","status":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/status","fees":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/fees","transactions":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/transactions","wire_details":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/wire_details","bpay_details":"/items/50847dcd-87e0-45e1-aedc-1f84476dc090/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 29 May 2016 21:12:40 GMT
recorded_with: VCR 2.9.3
