spec/fixtures/items_updated.yml

---
http_interactions:
- request:
    method: patch
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/items/1
    body:
      encoding: UTF-8
      string: '{"name":"updatedName"}'
    headers:
      User-Agent:
      - Faraday v0.9.1
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      - no-cache="set-cookie"
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 07 Jun 2015 09:05:24 GMT
      Location:
      - "/items/1"
      Server:
      - nginx/1.4.5 + Phusion Passenger 4.0.41
      Set-Cookie:
      - AWSELB=0DBB11830A38E977296412C0A203E644D732F49D5D8B1F8651E4AEE885D7AA8B7B9AC5F3ADB4A6F37B5FF8C730A7468BC5CA58DF2E7376E824BD49918D1818AC6660EDC9BD;PATH=/
      - request_method=PATCH; path=/
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.41
      X-Request-Id:
      - 1395238e-821d-4eea-8d8b-35ab1ccaed93
      X-Runtime:
      - '0.385465'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"items":{"id":"1","name":"updatedName","description":"description","created_at":"2015-06-07T08:37:53.931Z","updated_at":"2015-06-07T09:05:24.141Z","state":"pending","net_amount":103,"refunded_amount":0,"released_amount":0,"buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"deposit_reference":"9140140673","payment_type_id":1,"status":22000,"amount":103,"pending_release_amount":0,"promisepay_fee":500,"total_outstanding":103,"currency":"AUD","payment_method":"pending","buyer_name":"test
        name last_name","buyer_email":"email@email.com","buyer_country":"AUS","seller_name":"test
        name last_name","seller_email":"email@email.com","seller_country":"AUS","related":{"buyers":"1","sellers":"1"},"links":{"self":"/items/1","buyers":"/items/1/buyers","sellers":"/items/1/sellers","status":"/items/1/status","fees":"/items/1/fees","transactions":"/items/1/transactions","wire_details":"/items/1/wire_details","bpay_details":"/items/1/bpay_details"}}}'
    http_version: 
  recorded_at: Sun, 07 Jun 2015 09:05:24 GMT
recorded_with: VCR 2.9.3
